// if...else
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.

// const a = 10;

// if (a===10) {
//     console.log('Вірно');
// } else {
//     console.log('Невірно');
// }

// У змінній min лежить число від 0 до 59. Визначте у котру чверть години
// Попадає це число (у першу, другу, третю або четверту).

// const min = 60;

// if (min >= 0 && min <= 15) {
//     console.log('Перша чверть');
// } else if (min > 15 && min <= 30) {
//     console.log('Друга чверть');
// } else if (min > 30 && min <= 45) {
//     console.log('Третя чверть');
//     } else if (min > 45 && min <=59) {
//     console.log('Четверта чверть');
// } else {
//     console.log('Такої чверті не існує');
//  }

// ternary

// console.log(a === 10 ? 'Вірно' : 'Невірно');

// for, while

// switch